import { MAIL_ADDRESS } from '@/constants'

export const mailtoTemplate = {
  contact: `mailto:${MAIL_ADDRESS}?subject=お問い合わせ&body=お問い合わせ%0D%0A%0D%0A以下の内容を入力して送信してください。%0D%0A%0D%0A===========================================%0D%0A%0D%0A■お客様情報%0D%0Aお名前：%20%0D%0Aお電話番号：%20%0D%0Aお問い合わせ内容：%0D%0A%20%0D%0A===========================================`,
  recruit: `mailto:${MAIL_ADDRESS}?subject=入社希望に関するお問い合わせ&body=入社希望に関するお問い合わせ%0D%0A%0D%0A以下の内容を入力して送信してください。%0D%0A%0D%0A===========================================%0D%0A%0D%0A■お客様情報%0D%0Aお名前：%20%0D%0Aお電話番号：%20%0D%0A住所：%20%0D%0A面接のご希望日1：%20%0D%0A面接のご希望日2：%20%0D%0A面接のご希望日3：%20%0D%0A%0D%0A===========================================`,
  internship: `mailto:${MAIL_ADDRESS}?subject=職場体験に関するお問い合わせ&body=職場体験に関するお問い合わせ%0D%0A%0D%0A以下の内容を入力して送信してください。%0D%0A%0D%0A===========================================%0D%0A%0D%0A■お客様情報%0D%0Aお名前：%20%0D%0Aお電話番号：%20%0D%0A住所：%20%0D%0A体験のご希望日1：%20%0D%0A体験のご希望日2：%20%0D%0A体験のご希望日3：%20%0D%0A%0D%0A===========================================`,
}
